const dataNadzom = [
  {
    "kitab": "Alala tanalul ilma",
    "bait": 1,
    "teks_asli": "اَلاَ لاَتَنَالُ الْعِلْمَ اِلاَّ بِســــِتَّةٍ ۞ سَأُنْبِيْكَ عَنْ مَجْمُوْعِهَا بِبَيَانٍ",
    "teks_pencarian": "الا لاتنال العلم الا بستة ۞ سأنبيك عن مجموعها ببيان"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 2,
    "teks_asli": "ذُكَاءٍ وَحِرْصٍ وَاصْطِبَارٍ وَبُلْغَةٍ ۞ وَاِرْشَادُ اُسْتَاذٍ وَطُوْلِ زَمَانٍ",
    "teks_pencarian": "ذكاء وحرص واصطبار وبلغة ۞ وارشاد استاذ وطول زمان"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 3,
    "teks_asli": "عَنِ الْـمَرْءِ لاَ تَسْأَلْ وَسَلْ عَنْ قَرِيْنِهِ ۞ فَإِنَّ القَرِيْنَ بِالْـمُقَـارِنِ يَقْتَـــدِيْ",
    "teks_pencarian": "عن المرء لا تسأل وسل عن قرينه ۞ فإن القرين بالمقارن يقتدي"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 4,
    "teks_asli": "فَاِنْ كَانَ ذَا شَرٍّ فَجَنِّبْـهُ سُــرْعَةً ۞ فَاِنْ كَانَ ذَاخَيْرٍ فَقَارِنْهُ تَهْتَـدِيْ",
    "teks_pencarian": "فان كان ذا شر فجنبه سرعة ۞ فان كان ذاخير فقارنه تهتدي"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 5,
    "teks_asli": "تَعَـلَّمْ فَاِنَّ اْلعِلْمَ زَيْنٌ لِأَهْلِهِ ۞ وَفَضْلٌ وَعِنْوَانٌ لِكُلِّ الْمَحَامِدِ",
    "teks_pencarian": "تعلم فان العلم زين لأهله ۞ وفضل وعنوان لكل المحامد"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 6,
    "teks_asli": "وَكُنْ مُسْتَفِيْدًا كُلَّ يَوْمٍ زِيـَـادَةً  ۞ مِنَ الْعِلْمِ، وَاسْبحْ فِىْ بُحُوْرِ الْفَوَائِدِ",
    "teks_pencarian": "وكن مستفيدا كل يوم زيادة  ۞ من العلم، واسبح فى بحور الفوائد"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 7,
    "teks_asli": "تَفَقَّـهْ فَاِنَّ اْلفِقْــــهَ اَفْضَلٌ قَائِـدِ ۞ اِلَى الْبِّرِوَالتَّقْوَى وَاَعْدَلُ قَاصِدِ",
    "teks_pencarian": "تفقه فان الفقه افضل قائد ۞ الى البروالتقوى واعدل قاصد"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 8,
    "teks_asli": "هُوَاْلعِلْمُ اْلهَادِىْ اِلَى سُنَنِ الْهُــدَى ۞ هُوَالْحِصْنُ يُنْجِىْ مِنْ جَمِيْعِ الشَّدَائِدِ",
    "teks_pencarian": "هوالعلم الهادى الى سنن الهدى ۞ هوالحصن ينجى من جميع الشدائد"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 9,
    "teks_asli": "فَـــاِنَّ فَقِيْهًــا وَاحِـــدًامُتَوَرِّعًـا ۞ اَشَدُّعَلَى الشَّيْطَانِ مِنْ اَلْفِ عَابِدِ",
    "teks_pencarian": "فان فقيها واحدامتورعا ۞ اشدعلى الشيطان من الف عابد"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 10,
    "teks_asli": "فَسَــادٌ كَبِيْرٌ عَــــالِمٌ مُـتَهَتِّــــكٌ ۞ وَ اَكْبَرُ مِنْهُ جَاهِلٌ مُتَنَسِّكُ",
    "teks_pencarian": "فساد كبير عالم متهتك ۞ و اكبر منه جاهل متنسك"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 11,
    "teks_asli": "هُمَا فِتْنَةٌ فِي الْعَالَمِيْنَ عَظِيْمَةٌ ۞ لِمَنْ بِهِمَا فِيْ دِيْنِــــــهِ يَتَمَسَّكُ",
    "teks_pencarian": "هما فتنة في العالمين عظيمة ۞ لمن بهما في دينه يتمسك"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 12,
    "teks_asli": "تَمَنَّيْتَ اَنْ تُمْسِىَ فَقِيْهًا مُنَاظِرًا ۞ بِغَيْرِ عِنَــــاءٍ وَالْجُنُـــوْنُ فُـنُوْنُ",
    "teks_pencarian": "تمنيت ان تمسى فقيها مناظرا ۞ بغير عناء والجنون فنون"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 13,
    "teks_asli": "وَلَيْسَ اكْتِسَابُ الْمَالِ دُوْنَ مَشَقَّةٍ ۞ تَحَمَّلُـهَــا فَالْعِـلْمُ كَيْفَ يَكُوْنُ",
    "teks_pencarian": "وليس اكتساب المال دون مشقة ۞ تحملها فالعلم كيف يكون"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 14,
    "teks_asli": "اِذَا تَـمَّ عَقْلُ الْمَرْءِ قَلَّ كَلاَمُهُ ۞ وَاَيْقِنْ بِحُمْقِ الْمَرْءِ اِنْ كَانَ مُكْثِرًا",
    "teks_pencarian": "اذا تم عقل المرء قل كلامه ۞ وايقن بحمق المرء ان كان مكثرا"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 15,
    "teks_asli": "يَمُوْتُ الفَتَى مِنْ عَثْرَةٍ مِنْ لِّسَـانِهِ ۞ وَلَيسَ يَمُوتُ الْمَرْءِ مِنْ عَثْرَةِ الرِّجْلِ",
    "teks_pencarian": "يموت الفتى من عثرة من لسانه ۞ وليس يموت المرء من عثرة الرجل"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 16,
    "teks_asli": "فَعَثْرَتُهُ مِنْ فِيْــــهِ تَرْمِىْ بِرَأْسِـهِ ۞ وَعَثْرَتُهُ بِالرِّجْلِ تَبْرَى عَلَى الْمَهْلِ",
    "teks_pencarian": "فعثرته من فيه ترمى برأسه ۞ وعثرته بالرجل تبرى على المهل"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 17,
    "teks_asli": "أَخُو الْعِلْمِ حَيُّ خَالِدٌ بَعْدَ مَوْتِهِ ۞ وَأَوْصَـالُهُ تَحْتَ التُّرَابِ رَمِيْـــــمُ",
    "teks_pencarian": "أخو العلم حي خالد بعد موته ۞ وأوصاله تحت التراب رميم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 18,
    "teks_asli": "وَذُوالْجَهْلِ مَيْتٌ وَهُوَ يَمْشِى عَلَى الثَّرَى ۞ يُــظَنُّ مِنَ اْلاَحْيَـــاءِ وَهُوَ عَدِيْــمُ",
    "teks_pencarian": "وذوالجهل ميت وهو يمشى على الثرى ۞ يظن من الاحياء وهو عديم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 19,
    "teks_asli": "لِكُلٍّ اِلَى شَأْوِ الْعُلَى حَرَكَاتُ ۞ وَلَكِنْ عَزِيْزٌ فِى الرِّجَالِ ثُبَاتُ",
    "teks_pencarian": "لكل الى شأو العلى حركات ۞ ولكن عزيز فى الرجال ثبات"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 20,
    "teks_asli": "اِذَا كُنْتَ فِىْ قَوْمٍ فَصَاحِبْ خِيَـارَهُمْ ۞ وَلاَ تُصْحَبِ اْلاَرْدَى فَتُرْدَى مَعَ الرَّدِىْ",
    "teks_pencarian": "اذا كنت فى قوم فصاحب خيارهم ۞ ولا تصحب الاردى فتردى مع الردى"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 21,
    "teks_asli": "أُقَـدِّمُ أُسْتَــاذِىْ عَلَى نَفْسِ وَالِدِىْ ۞ وَاِنْ نَالَنِىْ مِنَ وَالِدِى الْفَضْلَ وَالشَّرَفَ",
    "teks_pencarian": "أقدم أستاذى على نفس والدى ۞ وان نالنى من والدى الفضل والشرف"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 22,
    "teks_asli": "فَذَاكَ مُرَبِّ الرُّوْحِ وَالرُّوْحُ جَــــوْهَرُ ۞ وَهَذَا مُرَبِّ الْجِسْمِ وَالْجِسْمُ كَالصَّدَفْ",
    "teks_pencarian": "فذاك مرب الروح والروح جوهر ۞ وهذا مرب الجسم والجسم كالصدف"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 23,
    "teks_asli": "رَأَيْتُ اَحَقَّ الْحَقِّ حَقَّ الْمُعَلِّمِ ۞ وَأَوْجَبَهُ حِفْظًا عَلَى كُلِّ مُسْلِم",
    "teks_pencarian": "رأيت احق الحق حق المعلم ۞ وأوجبه حفظا على كل مسلم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 24,
    "teks_asli": "رَأَيْتُ اَحَقَّ الْحَقِّ حَقَّ الْمُعَلِّمِ ۞ وَأَوْجَبَهُ حِفْظًا عَلَى كُلِّ مُسْلِم",
    "teks_pencarian": "رأيت احق الحق حق المعلم ۞ وأوجبه حفظا على كل مسلم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 25,
    "teks_asli": "لَقَدْ حَقَّ اَنْ يُّهْدَى اِلَيهِ كَرَامَـةً ۞ لِتَعْلِيْمِ حَرْفِ وَاحِدٍ اَلْفُ دِرْهَمٍ",
    "teks_pencarian": "لقد حق ان يهدى اليه كرامة ۞ لتعليم حرف واحد الف درهم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 26,
    "teks_asli": "اَرَى لَكَ نَفْسًا تَشْتَهِىَ اَنْ تُعِزَّهَا ۞ فَلَسْتَ تَنَــالُ الْعِزَّ حَتَّى تُذِلَّهــــاَ",
    "teks_pencarian": "ارى لك نفسا تشتهى ان تعزها ۞ فلست تنال العز حتى تذلها"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 27,
    "teks_asli": "ﺇذَا سَاءَ فِعْلُ الْمَرْءِ سَاءَ ظُنُوْنُهُ ۞ وَصَـدَّقَ مَا يَعْتَـادُهُ مِنْ تَوَهُّمِ",
    "teks_pencarian": "ﺇذا ساء فعل المرء ساء ظنونه ۞ وصدق ما يعتاده من توهم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 28,
    "teks_asli": "فَمَا النَّاسُ اِلاَّ وَاحـِدٌ مِنْ ثَلاَثَةٍ ۞ شَرِيْفٌ وَمَشْرُوْفٌ وَمِثْلٌ مُقَاوِمُ",
    "teks_pencarian": "فما الناس الا واحد من ثلاثة ۞ شريف ومشروف ومثل مقاوم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 29,
    "teks_asli": "فَاَمَّا الَّذِىْ فَوْقِىْ فَأَعْرِفُ قَــدْرَهُ ۞ وَاَتْبَــعُ فِيْهِ الْحَــقَّ وَالْحَــقُّ لاَزِمُ",
    "teks_pencarian": "فاما الذى فوقى فأعرف قدره ۞ واتبع فيه الحق والحق لازم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 30,
    "teks_asli": "فَاَمَّا الَّذِىْ مِثْلِى فَاِنْ زَلَّ اَوْهَفَـــا ۞ تَفَضَّـلْتُ اِنَّ الْفَضْـلَ بِالْفَخْرِحَــــاكِمُ",
    "teks_pencarian": "فاما الذى مثلى فان زل اوهفا ۞ تفضلت ان الفضل بالفخرحاكم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 31,
    "teks_asli": "فَاَمَّا الَّذِىْ دُوْنِىْ فَاَحْلَمُ دَائِبًـا ۞ أَصُوْنُ بِهِ عِرْضِى وَاِنْ لاَمَ لاَئِمُ",
    "teks_pencarian": "فاما الذى دونى فاحلم دائبا ۞ أصون به عرضى وان لام لائم"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 32,
    "teks_asli": "دَعِ الْمَرْءَ لاَتُجْزِ عَلَى سُوْءِ فِعْلِهِ ۞ سَيَكْفِيْهِ مَا فِيْــــهِ وَمَا هُوَ فَاعِلُهُ",
    "teks_pencarian": "دع المرء لاتجز على سوء فعله ۞ سيكفيه ما فيه وما هو فاعله"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 33,
    "teks_asli": "أَلَيْسَتْ مِنَ الْخُسْرَانِ اَنَّ لَيَالِيَا ۞ تَمُرُّ بِلاَ نَفْعٍ وَتُحْسَبُ مِنْ عُمْرِىْ",
    "teks_pencarian": "أليست من الخسران ان لياليا ۞ تمر بلا نفع وتحسب من عمرى"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 34,
    "teks_asli": "تَعَـــلَّمْ فَلَيْسَ الْمَرْءُ يوْلَدُ عَالِمًــــا ۞ وَلَيْسَ أَخُوْ  عِلْمٍ كَمَنْ هُوَ جَاهِلُ",
    "teks_pencarian": "تعلم فليس المرء يولد عالما ۞ وليس أخو  علم كمن هو جاهل"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 35,
    "teks_asli": "تَغَرَّبْ عَنِ اْلاَوْطَانِ فِى طَلَبِ الْعُلىَ ۞ وَسَـافِرْ فَفِى اْلاَسْفَارِ خَمْسُ فَوَائِـدِ",
    "teks_pencarian": "تغرب عن الاوطان فى طلب العلى ۞ وسافر ففى الاسفار خمس فوائد"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 36,
    "teks_asli": "تَفَــرُّجُ هَــمٍّ وَاكْتِسَـابِ مَعِيْشَــةٍ ۞ وَعِلـــمٌ وَآدَابٌ وَ صُحْبَــةُ مَــاجِدِ",
    "teks_pencarian": "تفرج هم واكتساب معيشة ۞ وعلم وآداب و صحبة ماجد"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 37,
    "teks_asli": "وَاِنْ قِيْـلَ فِى اْلاَسْفَـارِ ذُلٌّ وَغُرْبَــهٌ ۞ وَ قَطْـعُ فَيَـافٍ وَ ارْتِكَابُ شَـــدَائِدَ",
    "teks_pencarian": "وان قيل فى الاسفار ذل وغربه ۞ و قطع فياف و ارتكاب شدائد"
  },
  {
    "kitab": "Alala tanalul ilma",
    "bait": 38,
    "teks_asli": "فَمَوْتُ الْفَتَى خَيْرٌ لَهُ مِنْ حَيَاتِهِ ۞ بِدَارِ هَوَانٍ بَيْنَ وَاشٍ وَحَاسِدٍ",
    "teks_pencarian": "فموت الفتى خير له من حياته ۞ بدار هوان بين واش وحاسد"
  }
];

